common/models/tables/Users.php

    public static function getUsersList() {
        return self::find()
            ->select(['username'])
            ->indexBy('id')
            ->column();
---
SELECT `username`, `user`.`id` FROM `user`